# design_vision script for the synthesis

# Variables
# Increment version as you do new synthesis to avoid overwriting old reports
variable version $SYN_VERSION

# Analyze the VHDL files from the src folder
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/FPmul.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/fpmul_stage1_struct.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/fpmul_stage2_struct.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/fpmul_stage3_struct.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/fpmul_stage4_struct.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/bru.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/dadda_tree.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/full_adder.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/half_adder.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/pp_generation.vhd
analyze -f vhdl -lib WORK ../../src/fpmul_mbe_fastadder/mbe_mult.vhd
analyze -f vhdl -lib WORK ../../src/common/fpnormalize_fpnormalize.vhd
analyze -f vhdl -lib WORK ../../src/common/fpround_fpround.vhd
analyze -f vhdl -lib WORK ../../src/common/packfp_packfp.vhd
analyze -f vhdl -lib WORK ../../src/common/unpackfp_unpackfp.vhd

# Preserve rtl names to ease the procedure for power consumption estimation
set power_preserve_rtl_hier_names true
# Elaborate the architecture
elaborate $ENTITY_NAME -lib WORK
uniquify
link

# Set constraints
# Create a clock whose period is set in the variable at the beginning of this document
create_clock -name MY_CLK -period $PERIOD clk
report_clock > reports/clock_report_$version.txt
set_dont_touch_network MY_CLK
set_fix_hold MY_CLK
# Set clock uncertainty
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

# Synthesize
ungroup -all -flatten
compile
report_resources > reports/report_resources.txt

# Print reports
report_timing -delay max > reports/timing_report_setup_$version.txt
report_timing -delay min > reports/timing_report_hold_$version.txt
report_area > reports/area_report_$version.txt
report_power > reports/power_report_noswitching_$version.txt


# Save files for switching-activity-based power estimation
change_names -hierarchy -rules verilog
#write_sdf ../netlist/$ENTITY_NAME.sdf
write -f verilog -hierarchy -output ../../netlist/$ENTITY_NAME.v
#write_sdc ../netlist/$ENTITY_NAME.sdc

quit
